//package Habr440436.Main;
//// Найдите корень уравнения
////
////        $cos(x^5) + x^4 - 345.3 * x - 23 = 0$
////
////        на отрезке [0; 10] с точностью по x не хуже, чем 0.001. Известно, что на этом промежутке корень единственный.
////        Используйте для этого метод деления отрезка пополам (и рекурсию).
//public class Coren {
//    public static void main(String[] args) {
//        System.out.println(form);
//    }
//    static int x;
//    static double form = Math.cos(Math.pow(x, 5)) + Math.pow(x, 4) - 345.3 * x - 23;
//
//
//}
